src/test/resources/dk/apaq/dinero/repository/invoices_list.json

{
  "Collection": [
    {
      "Number": 9223372036854775807,
      "Guid": "2aa6fda2-9649-483e-82ec-094567eedfd6",
      "ContactName": "Børge Lund",
      "Date": "2017-05-19",
      "PaymentDate": "2017-05-27",
      "Description": "Faktura",
      "Currency": "DKK",
      "Status": "Draft",
      "MailOutStatus": "NotSent",
      "TotalExclVatInDkk": 0,
      "TotalInclVatInDkk": 0,
      "TotalExclVat": 0,
      "TotalInclVat": 0,
      "CreatedAt": "2017-05-19T14:20:47.407",
      "UpdatedAt": "2017-05-19T14:20:47.407",
      "DeletedAt": null
    },
    {
      "Number": 1,
      "Guid": "626911cd-e133-43cc-a73d-d4c6a6bc7501",
      "ContactName": "Børge Lund",
      "Date": "2017-05-19",
      "PaymentDate": "2017-05-27",
      "Description": "Faktura",
      "Currency": "DKK",
      "Status": "Overdue",
      "MailOutStatus": "NotSent",
      "TotalExclVatInDkk": 200,
      "TotalInclVatInDkk": 250,
      "TotalExclVat": 200,
      "TotalInclVat": 250,
      "CreatedAt": "2017-05-19T14:15:29.55",
      "UpdatedAt": "2017-05-19T14:15:30.43",
      "DeletedAt": null
    }
  ]
}