src/test/resources/dk/apaq/dinero/repository/invoices_single.json

{
  "PaymentDate": "2017-05-27",
  "PaymentStatus": "Draft",
  "PaymentConditionNumberOfDays": 8,
  "PaymentConditionType": "Netto",
  "Status": "Draft",
  "ContactGuid": "716a3105-e8fd-4fdd-a886-0490b047986f",
  "Guid": "2aa6fda2-9649-483e-82ec-094567eedfd6",
  "TimeStamp": "0000000008766398",
  "CreatedAt": "2017-05-19T14:20:47.407",
  "UpdatedAt": "2017-05-19T14:20:47.407",
  "DeletedAt": null,
  "Number": 2,
  "ContactName": "Børge Lund",
  "ShowLinesInclVat": false,
  "TotalExclVat": 0,
  "TotalVatableAmount": 0,
  "TotalInclVat": 0,
  "TotalNonVatableAmount": 0,
  "TotalVat": 0,
  "TotalLines": [
    {
      "Type": "SubTotal",
      "TotalAmount": 0,
      "Position": 0,
      "Label": "Subtotal"
    },
    {
      "Type": "Total",
      "TotalAmount": 0,
      "Position": 2,
      "Label": "Total DKK"
    }
  ],
  "Currency": "DKK",
  "Language": "da-DK",
  "ExternalReference": null,
  "Description": "Faktura",
  "Comment": "",
  "Date": "2017-05-19",
  "ProductLines": [
    {
      "AccountName": "Salg af varer/ydelser m/moms",
      "BaseAmountValue": 0,
      "BaseAmountValueInclVat": 0,
      "TotalAmount": 0,
      "TotalAmountInclVat": 0,
      "ProductGuid": null,
      "Description": "",
      "Comments": "",
      "Quantity": 1,
      "AccountNumber": 1000,
      "Unit": "parts",
      "Discount": 0,
      "LineType": "Product"
    },
    {
      "AccountName": "Salg af varer/ydelser m/moms",
      "BaseAmountValue": 0,
      "BaseAmountValueInclVat": 0,
      "TotalAmount": 0,
      "TotalAmountInclVat": 0,
      "ProductGuid": "13213123123123123",
      "Description": "",
      "Comments": "",
      "Quantity": 1,
      "AccountNumber": 1000,
      "Unit": "parts",
      "Discount": 0,
      "LineType": "Product"
    }
  ],
  "Address": null
}